burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_qspi.h
/* QSPI chip select high cycle */
#define DCFG_CSHC(regval)                 (BITS(8,10) & ((uint32_t)(regval) << 8))
#define QSPI_CS_HIGH_TIME_1_CYCLE         DCFG_CSHC(0)                               /*!< QSPI CS stays high for at least 1 cycle */
#define QSPI_CS_HIGH_TIME_2_CYCLE         DCFG_CSHC(1)                               /*!< QSPI CS stays high for at least 2 cycle */
#define QSPI_CS_HIGH_TIME_3_CYCLE         DCFG_CSHC(2)                               /*!< QSPI CS stays high for at least 3 cycle */
#define QSPI_CS_HIGH_TIME_4_CYCLE         DCFG_CSHC(3)                               /*!< QSPI CS stays high for at least 4 cycle */
#define QSPI_CS_HIGH_TIME_5_CYCLE         DCFG_CSHC(4)                               /*!< QSPI CS stays high for at least 5 cycle */
#define QSPI_CS_HIGH_TIME_6_CYCLE         DCFG_CSHC(5)                               /*!< QSPI CS stays high for at least 6 cycle */
#define QSPI_CS_HIGH_TIME_7_CYCLE         DCFG_CSHC(6)                               /*!< QSPI CS stays high for at least 7 cycle */
#define QSPI_CS_HIGH_TIME_8_CYCLE         DCFG_CSHC(7)                               /*!< QSPI CS stays high for at least 8 cycle */

/* QSPI instruction mode */
#define TCFG_IMODE(regval)                (BITS(8,9) & ((uint32_t)(regval) << 8))
#define QSPI_INSTRUCTION_NONE             TCFG_IMODE(0)                              /*!< no instruction */
#define QSPI_INSTRUCTION_1_LINE           TCFG_IMODE(1)                              /*!< instruction on a single line */
#define QSPI_INSTRUCTION_2_LINES          TCFG_IMODE(2)                              /*!< instruction on two lines */
#define QSPI_INSTRUCTION_4_LINES          TCFG_IMODE(3)                              /*!< instruction on four lines */

/* QSPI address mode */
#define TCFG_ADDRMOD(regval)              (BITS(10,11) & ((uint32_t)(regval) << 10))
#define QSPI_ADDR_NONE                    TCFG_ADDRMOD(0)                            /*!< no address */
#define QSPI_ADDR_1_LINE                  TCFG_ADDRMOD(1)                            /*!< address on a single line */
#define QSPI_ADDR_2_LINES                 TCFG_ADDRMOD(2)                            /*!< address on two lines */
#define QSPI_ADDR_4_LINES                 TCFG_ADDRMOD(3)                            /*!< address on four lines */

/* QSPI address size */
#define TCFG_ADDRSZ(regval)               (BITS(12,13) & ((uint32_t)(regval) << 12))
#define QSPI_ADDR_8_BITS                  TCFG_ADDRSZ(0)                             /*!< 8 bits address */
#define QSPI_ADDR_16_BITS                 TCFG_ADDRSZ(1)                             /*!< 16 bits address */
#define QSPI_ADDR_24_BITS                 TCFG_ADDRSZ(2)                             /*!< 24 bits address */
#define QSPI_ADDR_32_BITS                 TCFG_ADDRSZ(3)                             /*!< 32 bits address */

/* QSPI alternate bytes mode */
#define TCFG_ALTEMOD(regval)              (BITS(14,15) & ((uint32_t)(regval) << 14))
#define QSPI_ALTE_BYTES_NONE              TCFG_ALTEMOD(0)                            /*!< no alternate bytes */
#define QSPI_ALTE_BYTES_1_LINE            TCFG_ALTEMOD(1)                            /*!< alternate bytes on a single line */
#define QSPI_ALTE_BYTES_2_LINES           TCFG_ALTEMOD(2)                            /*!< alternate bytes on two lines */
#define QSPI_ALTE_BYTES_4_LINES           TCFG_ALTEMOD(3)                            /*!< alternate bytes on four lines */

/* QSPI alternate bytes size */
#define TCFG_ALTESZ(regval)               (BITS(16,17) & ((uint32_t)(regval) << 16))
#define QSPI_ALTE_BYTES_8_BITS            TCFG_ALTESZ(0)                             /*!< 8 bits alternate byte */
#define QSPI_ALTE_BYTES_16_BITS           TCFG_ALTESZ(1)                             /*!< 16 bits alternate bytes */
#define QSPI_ALTE_BYTES_24_BITS           TCFG_ALTESZ(2)                             /*!< 24 bits alternate bytes */
#define QSPI_ALTE_BYTES_32_BITS           TCFG_ALTESZ(3)                             /*!< 32 bits alternate bytes */

/* QSPI data mode */
#define TCFG_DATAMOD(regval)              (BITS(24,25) & ((uint32_t)(regval) << 24))
#define QSPI_DATA_NONE                    TCFG_DATAMOD(0)                            /*!< no data */
#define QSPI_DATA_1_LINE                  TCFG_DATAMOD(1)                            /*!< data on a single line */
#define QSPI_DATA_2_LINES                 TCFG_DATAMOD(2)                            /*!< data on two lines */
#define QSPI_DATA_4_LINES                 TCFG_DATAMOD(3)                            /*!< data on four lines */

/* QSPI functional mode */
#define TCFG_FMOD(regval)                 (BITS(26,27) & ((uint32_t)(regval) << 26))
#define QSPI_INDIRECT_WRITE               TCFG_FMOD(0)                               /*! <indirect write mode */
#define QSPI_INDIRECT_READ                TCFG_FMOD(1)                               /*! <indirect read mode */
#define QSPI_AUTO_POLLING                 TCFG_FMOD(2)                               /*! <status polling mode */
#define QSPI_MEMORY_MAPPED                TCFG_FMOD(3)                               /*! <memory mapped mode */

/* QSPI sioo mode */
#define QSPI_SIOO_INST_EVERY_CMD          0x00000000U                                /*!< send instruction on every command sequence */
#define QSPI_SIOO_INST_ONLY_FIRST_CMD     QSPI_TCFG_SIOO                             /*!< send instruction only for the first command sequence */

/* QSPI timeout count */
#define QSPI_TMOUT_DISABLE                0x00000000U                                /*!< disable timeout counter */
#define QSPI_TMOUT_ENABLE                 QSPI_CTL_TMOUTEN                           /*!< enable timeout counter */

/* QSPI match mode */
#define QSPI_MATCH_MODE_AND               0x00000000U                                /*!< and match mode */
#define QSPI_MATCH_MODE_OR                QSPI_CTL_SPMOD                             /*!< or match mode */

