burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_qspi.h
/* QSPI automatic stop */
#define QSPI_AUTO_STOP_DISABLE            0x00000000U                                /*!< disable automatic stop */
#define QSPI_AUTO_STOP_ENABLE             QSPI_CTL_SPS                               /*!< enable automatic stop */

/* QSPI interrupt enable/disable constants definitions */
#define QSPI_INT_TC                      ((uint8_t)0x00U)                            /*!< transfer complete interrupt */
#define QSPI_INT_FT                      ((uint8_t)0x01U)                            /*!< FIFO threshold interrupt */
#define QSPI_INT_TERR                    ((uint8_t)0x02U)                            /*!< transfer error interrupt */
#define QSPI_INT_SM                      ((uint8_t)0x03U)                            /*!< status match interrupt */
#define QSPI_INT_TMOUT                   ((uint8_t)0x04U)                            /*!< timeout interrupt */
#define QSPI_INT_WS                      ((uint8_t)0x05U)                            /*!< wrong start sequence interrupt */

/* constants definitions */
/* qspi init struct definitions */
typedef struct {
    uint32_t prescaler;           /* specifies the prescaler factor for generating clock based on the AHB clock.
                                  this parameter can be a number between 0 and 255 */
    uint32_t fifo_threshold;      /* specifies the threshold number of bytes in the FIFO (used only in indirect mode)
                                  this parameter can be a value between 1 and 16 */
    uint32_t sample_shift;        /* specifies the Sample Shift. the data is sampled 1/2 clock cycle delay later to
                                  take in account external signal delays */
    uint32_t flash_size;          /* specifies the Flash Size. FlashSize+1 is effectively the number of address bits
                                  required to address the flash memory. The flash capacity can be up to 4GB
                                  (addressed using 32 bits) in indirect mode, but the addressable space in
                                  memory-mapped mode is limited to 256MB
                                  this parameter can be a number between 0 and 31 */
    uint32_t cs_high_time;       /* specifies the chip select high time. cs_high_time+1 defines the minimum number
                                  of clock cycles which the chip select must remain high between commands */
    uint32_t clock_mode;           /* specifies the clock mode. it indicates the level that clock takes between commands */
} qspi_init_struct;

/* qspi command struct definitions */
typedef struct {
    uint32_t instruction_mode;   /* specifies the instruction mode */
    uint32_t instruction;        /* specifies the instruction to be sent this parameter can be a value (8-bit) between 0x00 and 0xFF */
    uint32_t addr_mode;          /* specifies the address mode */
    uint32_t addr_size;          /* specifies the address size */
    uint32_t addr;               /* specifies the address to be sent (Size from 1 to 4 bytes according addressSize)
                                  this parameter can be a value (32-bits) between 0x0 and 0xFFFFFFFF */
    uint32_t altebytes_mode;     /* specifies the alternate bytes mode */
    uint32_t altebytes_size;     /* specifies the alternate bytes size */
    uint32_t altebytes;          /* specifies the alternate Bytes to be sent (size from 1 to 4 bytes according alternatebytessize)
                                  this parameter can be a value (32-bits) between 0x0 and 0xFFFFFFFF */
    uint32_t dummycycles;        /* specifies the number of dummy cycles, this parameter can be a number between 0 and 31 */
    uint32_t data_mode;          /* specifies the data mode (used for dummy cycles and data phases) */
    uint32_t data_length;        /* specifies the number of data to transfer. (this is the number of bytes)
                                  this parameter can be any value between 0 and 0xFFFFFFFF (0 means undefined length until end of memory)*/
    uint32_t sioo_mode;          /* specifies the send instruction only once mode */
} qspi_command_struct;

/* qspi autopolling struct definitions */
typedef struct {
    uint32_t match;              /* specifies the value to be compared with the masked status register to get a match.
                                  this parameter can be any value between 0 and 0xFFFFFFFF */
    uint32_t mask;               /* specifies the mask to be applied to the status bytes received.
                                  this parameter can be any value between 0 and 0xFFFFFFFF */
    uint32_t interval;           /* specifies the number of clock cycles between two read during automatic polling phases.
                                  this parameter can be any value between 0 and 0xFFFF */
    uint32_t statusbytes_size;   /* specifies the size of the status bytes received.
                                  this parameter can be any value between 1 and 4 */
    uint32_t match_mode;         /* specifies the method used for determining a match. */
    uint32_t auto_stop;          /* specifies if automatic polling is stopped after a match. */
} qspi_autopolling_struct;

/* function declarations */
/* QSPI deinitialization and initialization functions */
/* reset QSPI */
void qspi_deinit(void);
/* initialize the parameters of QSPI init struct with the default values */
void qspi_init_struct_para_init(qspi_init_struct *qspi_struct);
/* initialize QSPI parameter */
void qspi_init(qspi_init_struct *qspi_struct);
/* enable QSPI */
void qspi_enable(void);
/* disable QSPI */
void qspi_disable(void);
/* enable QSPI DMA */
void qspi_dma_enable(void);
/* disable QSPI DMA */
void qspi_dma_disable(void);
/* configure QSPI data length */
void qspi_data_length_config(uint32_t dtlen);
/* QSPI command parameter configure*/
void qspi_command(qspi_command_struct *cmd);
/* QSPI transmit data */
void qspi_transmit(uint8_t tdata[]);
/* QSPI receive data */
void qspi_receive(uint8_t rdata[]);
/* configure QSPI autopolling mode */
void qspi_autopolling(qspi_command_struct *cmd, qspi_autopolling_struct *cfg);
/* configure QSPI memorymapped mode */
void qspi_memorymapped(qspi_command_struct *cmd, uint16_t timeout, uint32_t toen);
/* abort the current transmission */
void qspi_abort(void);

/* flag and interrupt functions */
/* enable QSPI interrupt */
void qspi_interrupt_enable(uint8_t interrupt);
/* disable QSPI interrupt */
void qspi_interrupt_disable(uint8_t interrupt);
/* get QSPI flag status */
FlagStatus qspi_flag_get(uint32_t flag);
/* clear QSPI flag status */
void qspi_flag_clear(uint32_t flag);

#endif /* gd32w51x_f5hc_QSPI_H */
